# Practica 1 - Pandas

In [1]:
import pandas as pd

In [3]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

In [6]:
df_occ = pd.read_csv(url, sep="|")

In [7]:
df_occ

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

## Ej 1: Muestra las primeras 25 filas. 

Resuelve este ejercicio de dos formas (o más).

In [9]:
# Método
df_occ.head(25)

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301
15       16   21      M  entertainment    10309
16       17   30      M     programmer    06355
17       18   35      F          other    37212
18       19   40      M      librarian    02138
19       20   42      F      homemaker    95660
20       21   26      M         writer    30068
21       22   25      M         writer    40206
22       23   30      F         artist    48197
23       24   21      F         artist    94533
24       25   39      M       engineer    55107

In [10]:
# Indexacion
df_occ.iloc[:25]

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301
15       16   21      M  entertainment    10309
16       17   30      M     programmer    06355
17       18   35      F          other    37212
18       19   40      M      librarian    02138
19       20   42      F      homemaker    95660
20       21   26      M         writer    30068
21       22   25      M         writer    40206
22       23   30      F         artist    48197
23       24   21      F         artist    94533
24       25   39      M       engineer    55107

## Ej 2: Muestra las ultimas 15 filas

In [12]:
# Método
df_occ.tail(15)

     user_id  age gender     occupation zip_code
928      929   44      M      scientist    53711
929      930   28      F      scientist    07310
930      931   60      M       educator    33556
931      932   58      M       educator    06437
932      933   28      M        student    48105
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

In [13]:
# Indexación
df_occ.iloc[-15:]

     user_id  age gender     occupation zip_code
928      929   44      M      scientist    53711
929      930   28      F      scientist    07310
930      931   60      M       educator    33556
931      932   58      M       educator    06437
932      933   28      M        student    48105
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

## Ej 3: ¿Cuantas observaciones (o filas) hay en este dataframe?

Resuelve este ejercicio de dos formas (o más)

In [16]:
# Ver el tamaño del índice
len(df_occ.index)

943

In [17]:
# Ver la longitud del DataFrame
len(df_occ)

943

In [15]:
# Ver el shape como en numpy
print(df_occ.shape)
print(f"Tenemos {df_occ.shape[0]} filas y {df_occ.shape[1]} columnas")

(943, 5)
Tenemos 943 filas y 5 columnas

In [18]:
# Con count o describe
df_occ.count()

user_id       943
age           943
gender        943
occupation    943
zip_code      943
dtype: int64

## Ej 4: ¿Cuantas columnas hay en este dataframe?

Resuelve este ejercicio de dos formas (o más)

In [21]:
# Con la longitud de la lista de columnas
len(df_occ.columns)

5

In [22]:
# Con el shape
df_occ.shape[1]

5

## Ej 5: Obtén una lista con el nombre de las columnas del dataframe

In [23]:
df_occ.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

## Ej 6: Obten el indice del Dataframe

In [26]:
list(df_occ.index)[:20]

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]

## Ej 7: Muestra los tipos de datos de las columnas

Resuelve este ejercicio de dos formas (o más)

In [29]:
# Con info
df_occ.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [27]:
# Con dtypes
df_occ.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

## Ej 8: Obten todos los valores de la columna occupation

Resuelve este ejercicio de dos formas (o más)

In [30]:
# Indexación de columna
df_occ["occupation"]

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

In [31]:
# Atributo
df_occ.occupation

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

In [33]:
# Con iloc
df_occ.iloc[:, 3]

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

## Ej 9: Obtén el número de ocupaciones diferentes que hay en el dataset y el número de usuarios por ocupación que hay en el dataframe

In [35]:
df_occ

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [37]:
# Longitud de usuarios únicos
df_occ['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [38]:
df_occ['occupation'].nunique()

21

In [52]:
# Agrupar y contar

## Ej 10: Cual es la ocupación más frecuente?

In [74]:
# Encontrar la que tiene el máximo de usuarios

## Ej 11: Haz un resumen estadistico del dataset.

In [15]:
# Con describe

## Ej 12: Calcula la media de edad de los usuarios por ocupación.

## Ej 13: cual es la edad menos frecuente en el dataset?